fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССорудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССорудниками/ВКМ_ВзаиморасчетыССорудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССорудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);

	// регистр ВКМ_ОсновныеНачисления
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = Строка.ВидНачисления;
		Движение.Оклад = 1;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
	КонецЦикла;
	
	// регистр ВКМ_ВзаиморасчетыССорудниками
	Движения.ВКМ_ВзаиморасчетыССорудниками.Записывать = Истина;
	
	Для Каждого Строка из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССорудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма;
	КонецЦикла;

КонецПроцедуры



#Область ДляОбработки
Процедура ДлявВ()
//Процедура ОбработкаПроведения(Отказ, Режим)
//	
//	ПериодРегистрации = НачалоМесяца(Дата);
//	ОсновнаяВалютаРасчета = РегистрыСведений.ОсновнаяВалютаРасчета.ПолучитьПоследнее(ПериодРегистрации).Валюта;
//	НачалоБазовогоПериодаОтпуска = ДобавитьМесяц(ПериодРегистрации, -3);
//	КонецБазовогоПериодаОтпуска = ПериодРегистрации -1;
//	
//	//Предварительное заполнение для расчетов
//	
//	Движения.ОсновныеНачисления.Записывать = Истина;
//	Движения.ДополнительныеНачисления.Записывать = Истина;
//	
//	Для Каждого Строка Из ОсновныеНачисления Цикл
//		
//		Движение = Движения.ОсновныеНачисления.Добавить();
//		ЗаполнитьЗначенияСвойств(Движение, Строка);
//		Движение.ВалютаУчета = ОсновнаяВалютаРасчета;
//		Движение.ПериодДействияНачало = Строка.ДатаНачала;
//		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
//		Движение.ПериодРегистрации = ПериодРегистрации;
//		
//		Если Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.НайтиПоНаименованию("Отпуск", Истина) Тогда
//			Движение.БазовыйПериодНачало = НачалоБазовогоПериодаОтпуска;
//			Движение.БазовыйПериодКонец = КонецБазовогоПериодаОтпуска;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Для Каждого Строка Из ДополнительныеНачисления Цикл
//		
//		Движение = Движения.ДополнительныеНачисления.Добавить();
//		ЗаполнитьЗначенияСвойств(Движение, Строка);
//		Движение.ПериодРегистрации = ПериодРегистрации;
//		Движение.ВалютаУчета = ОсновнаяВалютаРасчета;
//		Движение.Результат = Строка.Размер;
//		
//	КонецЦикла;
//	
//	Движения.Записать();
//	
//	//Расчет результата начислений
//	
//	
//	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//				|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
//				|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ДнейПериодДействия, 0) КАК РабочихДней,
//				|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ДнейФактическийПериодДействия, 0) КАК ОтработанныхДней,
//				|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
//				|	ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) + ЕСТЬNULL(ОсновныеНачисленияБазаДополнительныеНачисления.РезультатБаза, 0) КАК НачисленияВБазовомПериоде,
//				|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ДнейБазовыйПериод, 0) КАК ДнейВБазовомПериоде
//				|ПОМЕСТИТЬ ВТ_ДанныеГрафика
//				|ИЗ
//				|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
//				|			Регистратор = &Регистратор
//				|				И ВидРасчета В (&ВидыРасчета)) КАК ОсновныеНачисленияДанныеГрафика
//				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(
//				|				&Измерения,
//				|				&Измерения,
//				|				,
//				|				Регистратор = &Регистратор
//				|					И ВидРасчета В (&ВидыРасчета)) КАК ОсновныеНачисленияБазаОсновныеНачисления
//				|		ПО (ОсновныеНачисленияДанныеГрафика.НомерСтроки = ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки)
//				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.БазаДополнительныеНачисления(
//				|				&Измерения,
//				|				&Измерения,
//				|				,
//				|				Регистратор = &Регистратор
//				|					И ВидРасчета В (&ВидыРасчета)) КАК ОсновныеНачисленияБазаДополнительныеНачисления
//				|		ПО (ОсновныеНачисленияДанныеГрафика.НомерСтроки = ОсновныеНачисленияБазаДополнительныеНачисления.НомерСтроки)
//				|
//				|ИНДЕКСИРОВАТЬ ПО
//				|	Сотрудник
//				|;
//				|
//				|////////////////////////////////////////////////////////////////////////////////
//				|ВЫБРАТЬ
//				|	ВТ_ДанныеГрафика.НомерСтроки КАК НомерСтроки,
//				|	ВТ_ДанныеГрафика.РабочихДней КАК РабочихДней,
//				|	ВТ_ДанныеГрафика.ОтработанныхДней КАК ОтработанныхДней,
//				|	ЕСТЬNULL(СведенияОСотрудникахСрезПоследних.Оклад, 0) КАК Оклад,
//				|	ВТ_ДанныеГрафика.НачисленияВБазовомПериоде КАК НачисленияВБазовомПериоде,
//				|	ВТ_ДанныеГрафика.ДнейВБазовомПериоде КАК ДнейВБазовомПериоде
//				|ИЗ
//				|	ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика
//				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках.СрезПоследних(
//				|				&ПериодРегистрации,
//				|				Сотрудник В
//				|					(ВЫБРАТЬ
//				|						ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник
//				|					ИЗ
//				|						ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика)) КАК СведенияОСотрудникахСрезПоследних
//				|		ПО ВТ_ДанныеГрафика.Сотрудник = СведенияОСотрудникахСрезПоследних.Сотрудник";
//	
//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
//	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
//	
//	ВидыРасчета = Новый Массив;
//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисления.ОплатаПоОкладу);
//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисления.Отпуск);
//	Запрос.УстановитьПараметр("ВидыРасчета", ВидыРасчета);
//	
//	Измерения = Новый Массив;
//	Измерения.Добавить("Сотрудник");
//	Запрос.УстановитьПараметр("Измерения", Измерения);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Для Каждого Движение Из Движения.ОсновныеНачисления Цикл
//		
//		Выборка.Сбросить();
//		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
//		ЗаполнитьЗначенияСвойств(Движение, Выборка);
//		
//		Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Отпуск Тогда
//			
//			Движение.Результат = ?(Выборка.ДнейВБазовомПериоде <> 0, 
//									Выборка.НачисленияВБазовомПериоде / Выборка.ДнейВБазовомПериоде * Выборка.ОтработанныхДней, 0);
//			Продолжить;
//		КонецЕсли;
//
//		Движение.Результат = ?(Выборка.РабочихДней <> 0, 
//								Выборка.Оклад / Выборка.РабочихДней * Выборка.ОтработанныхДней, 0);
//	КонецЦикла;
//	
//	Движения.ОсновныеНачисления.Записать(, Истина);
//
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
//		|	ОсновныеНачисления.Подразделение КАК Подразделение,
//		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
//		|	СУММА(ОсновныеНачисления.Результат) КАК Сумма,
//		|	ОсновныеНачисления.ВалютаУчета КАК ВалютаУчета
//		|ИЗ
//		|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
//		|ГДЕ
//		|	ОсновныеНачисления.Регистратор = &Регистратор
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОсновныеНачисления.Подразделение,
//		|	ОсновныеНачисления.ВидРасчета,
//		|	ОсновныеНачисления.Сотрудник,
//		|	ОсновныеНачисления.ВалютаУчета";
//	
//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		Движение = Движения.ВзаиморасчетыССотрудниками.ДобавитьПриход();
//		ЗаполнитьЗначенияСвойств(Движение, Выборка);
//		Движение.Период = Дата;
//	КонецЦикла;
//	
//	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
//
КонецПроцедуры

#КонецОбласти
